# SteelElemHoleAlpha Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemHoleAlpha Property
ParameterTypeId Class See Also
---
"Taper Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemHoleAlpha { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemHoleAlpha As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemHoleAlpha {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace